# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [150]:
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [160]:
import numpy as np
serie1 = pd.Series(np.random.randint(1,4,size=100))
print(serie1)

serie2 = pd.Series(np.random.randint(1,3,size=100))
print(serie2)

serie3 = pd.Series(np.random.randint(10000,30000,size=100))
print(serie3)

0     3
1     1
2     2
3     2
4     2
     ..
95    1
96    2
97    3
98    3
99    3
Length: 100, dtype: int64
0     1
1     1
2     1
3     2
4     1
     ..
95    1
96    1
97    1
98    2
99    1
Length: 100, dtype: int64
0     23721
1     26557
2     18675
3     11194
4     23539
      ...
95    14530
96    28308
97    12303
98    20873
99    22133
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [161]:

data=pd.DataFrame([serie1,serie2,serie3]).T # T transpose index and columns
data

    0  1      2
0   3  1  23721
1   1  1  26557
2   2  1  18675
3   2  2  11194
4   2  1  23539
.. .. ..    ...
95  1  1  14530
96  2  1  28308
97  3  1  12303
98  3  2  20873
99  3  1  22133

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [162]:
df_all_col.columns=['bedrs','bathrs','price_sqr_meter']
df_all_col

    bedrs  bathrs  price_sqr_meter
0       2       1            24041
1       3       1            12385
2       2       1            22776
3       1       1            14471
4       1       2            17174
..    ...     ...              ...
95      2       2            21269
96      3       1            22931
97      1       2            12199
98      2       2            10686
99      3       1            27678

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [154]:

bigcolumn=pd.concat([serie1,serie2,serie3])
bigcolumn

0         3
1         3
2         3
3         3
4         2
      ...
95    18154
96    19068
97    10715
98    13075
99    11709
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [157]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [171]:
bigcolumn.reset_index(drop=True)

0          3
1          3
2          3
3          3
4          2
       ...
295    18154
296    19068
297    10715
298    13075
299    11709
Length: 300, dtype: int64